In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [4]:
stores = pd.read_csv(r"..\Data\01_raw\stores.csv")
stores.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [5]:
stores.shape

(54, 5)

In [6]:
output = []

for column in stores.columns:

    null_values  = np.sum(pd.isna(stores[column]))
    unique = stores[column].nunique()
    column_data_type = stores[column].dtype

    output.append([column, null_values, unique, column_data_type])

output_df = pd.DataFrame(output, columns = ['column','null values', 'unique', 'datatype'])

describe_df = stores.describe().transpose() 
combine_df = pd.concat([ output_df.set_index('column'), describe_df], axis = 1, join='outer')

combine_df

,null values,unique,datatype,count,mean,std,min,25%,50%,75%,max
store_nbr,0,54,int64,54.0,27.500000,15.732133,1.0,14.25,27.5,40.75,54.0
city,0,22,object,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
state,0,16,object,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
type,0,5,object,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
cluster,0,17,int64,54.0,8.481481,4.693395,1.0,4.00,8.5,13.00,17.0

In [7]:
stores.drop_duplicates(inplace=True)

In [8]:
stores.shape

(54, 5)